cf_billing/ChartsOfCharacteristicTypes/бестПараметрыТиповСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>бестПараметрыТиповСобытий</Name>
			<Type>
				<v8:Type>cfg:EnumRef.бестСпособыОтправки</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.энргСуды</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.бестДополнительныеЗначенияПараметровТиповСобытий</v8:Type>
				<v8:Type>cfg:CatalogRef.энргСудебныеУчастки</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>250</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СрокДляОтправкиЗаказнойПочтой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДляВрученияПодРоспись</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтКрайнейДатыПогашенияДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

cf_billing/ChartsOfCharacteristicTypes/бестПараметрыТиповСобытий/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры
	
#КонецОбласти

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	ЭтоСрокПогашенияЗадолженности = Объект.Ссылка = ПредопределенноеЗначение("ПланВидовХарактеристик.бестПараметрыТиповСобытий.СрокПогашенияЗадолженности");
	ЭтоПланируемаяДатаВведенияОРП = Объект.Ссылка = ПредопределенноеЗначение("ПланВидовХарактеристик.бестПараметрыТиповСобытий.ПланируемаяДатаВведенияОРП");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СрокДляОтправкиЗаказнойПочтой"	, "Видимость", ЭтоСрокПогашенияЗадолженности);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СрокДляВрученияПодРоспись"		, "Видимость", ЭтоСрокПогашенияЗадолженности);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СрокОтКрайнейДатыПогашенияДолга", "Видимость", ЭтоПланируемаяДатаВведенияОРП);
КонецПроцедуры
